[
  {
    "version": "0.6.0",
    "date": "2025-04-13",
    "notes": [
      "[NEW] Added notification system and a new setting to enable/disable it. Check the settings page.",
      "[NEW] Added a new setting to personalize the 'search' shortcut. Check the settings page.",
      "[NEW] Added keyboard navigation (with arrow keys) in the shortcut grid.",
      "[ENHANCEMENT] Added the app icon in the app window title.",
      "[NEW] Added support for Eclipse IDE.",
      "[NEW] Added changelog system and window.",
      "[ENHANCEMENT] Improved settings page layout and tooltips."
    ]
  },
  {
    "version": "0.6.1",
    "date": "2025-04-13",
    "notes": [
      "[FIX] Fixed bat script launcher for Windows.",
      "[NEW] Added check for updates feature.",
      "[NEW] Added a new setting to enable/disable the check for updates at startup. Default is disabled.",
      "[ENHANCEMENT] Changelog system now shows the last 3 versions."
    ]
  },
  {
    "version": "0.6.2",
    "date": "2025-04-13",
    "notes": [
      "[ENHANCEMENT] Now the bat script launcher close the console window after the app is started.",
      "[FIX] Fixed the application stop, now unregister the native hook before stopping."
    ]
  },
  {
    "version": "0.7.0",
    "date": "2025-04-16",
    "notes": [
      "[FIX] Upgraded JavaFX from 20 to 20.0.2 to fix CVE issues.",
      "[ENHANCEMENT] Replacing shortcuts.json file with SQLite database. User defined shortcuts are temporally removed.",
      "[NEW] Added a cache system to store the last used app shortcuts. Check the settings page to set the cache size.",
      "[NEW] Added preload system to load the last used app shortcuts at startup. Check the settings page to set the preload size.",
      "[ENHANCEMENT] Replacing singleton pattern with dependency injection.",
      "[NEW] Added support for MS Teams, MS Word, MS Excel, MS PowerPoint, MS Outlook, Firefox.",
      "[ENHANCEMENT] Replaced timer with a scheduled executor service to improve performance."
    ]
  },
  {
    "version": "0.8.0",
    "date": "2025-04-25",
    "notes": [
      "[FIX] Shortcuts are now hidden when focus lost.",
      "[FIX] Fixed KEY_HOLD detection failure on systems with key repeat",
      "[ENHANCEMENT] KEY_HOLD detection timer now resets on any subsequent key press.",
      "[NEW] You can now add support for any app from the app interface. Check 'Shortcut Editor' section.",
      "[NEW] You can now add/modify/delete shortcuts for an existing app from the app interface. Check 'Shortcut Editor' section.",
      "[NEW] Added support for (some) UWP apps.",
      "[NEW] Added support for Whatsapp Desktop (UWP), Notepad."
    ]
  },
  {
    "version": "0.9.0",
    "date": "2025-04-26",
    "notes": [
      "[FIX] Closing the app when other windows are open now closes all windows.",
      "[NEW] Added ability to restore default shortcut keys. Look for the restore button in the Shortcut Editor.",
      "[NEW] Added favorite shortcuts system. You can now mark any shortcut as favorite and it will be shown in the favorites section (max 5). In addition, for each one, you can press [1] to [5] to execute it.",
      "[ENHANCEMENT] Logging level is now set to ERROR by default, log files are now less verbose."
    ]
  },
  {
    "version": "1.0.0",
    "date": "2025-05-01",
    "notes": [
      "[NEW] Added usage statistics for shortcuts. Now shortcuts are displayed by usage frequency.",
      "[ENHANCEMENT] Settings are now stored in the database instead of a JSON file.",
      "[ENHANCEMENT] Settings are now grouped by category. Renewed the settings page.",
      "[FIX] Application icons are now correctly loaded.",
      "[NEW] Added Italian language support.",
      "[ENHANCEMENT] Shortcut window is now, as default, bigger (720x600)."
    ]
  }
]
